package com.kh.ArrayEx;
/*
 배열(Array) : 동일한 자료형의 데이터를 한 번에 나열한 장바구니형 자료 구조이다.
 			 하나의 변수명으로 여러개의 값을 관리하게 해준다.
 			 장바구니에는 각 자리가 숫자로 지정되어 있는데, 이것을 인덱스(index) 라고 부른다.
 			 인덱스는 0 부터 시작하고, 마지막(끝) 은 -1 로 부른다. (0 부터 시작하기 때문이다.)
 			 
 배열을 표현하는 방법
 	자료형[] 이름 = new 자료형[장바구니에 담을 수 있는 갯수];
 	자료형 이름[] = new 자료형[장바구니에 담을 수 있는 갯수];
 	
 	예를 들어
 		String[] 배열1번 = new String[5]; // 크기는 5, index는 0 ~ 4 가 존재
 		String 배열1번[] = new String[5]; // 크기는 5, index는 0 ~ 4 가 존재
 		
 	배열에는 아무것도 넣지 않은 채로, 위의 예제처럼 장바구니같이 배열에 담을 수 있는 갯수만 지정해도 상관 없지만, 
 	처음부터 값을 채워서 넣을 수도 있다.
 	자료형[] 이름 = {값1, 값2, 값3, ...}
 	자료형 이름[] = {값1, 값2, 값3, ...}
 	
 	예를 들어
 		int[] 숫자들 = {1, 2, 3, 4, 5}; // 크기는 5, index는 4까지 존재
 		int 숫자들[] = {1, 2, 3, 4, 5}; // 크기는 5, index는 4까지 존재
 */
public class 배열 {

}
