package com.kh.BasicEx;
/*
 접근제어자 : 클래스나 변수, 메서드(생성자) 등의 접근 권한을 지정하는 키워드이다.
          접근을 제한하거나, 허용할 수 있다.
          
              public : 모든 접근을 허용한다.
           protected : 같은 폴더 안에 있는 클래스들과, 해당 클래스를 상속한 클래스만 접근을 허용한다.
             default : 따로 접근제어자를 작성하지 않았을 경우, default 로 설정된다.
             private : 외부에서의 접근을 제한한 것으로, 오직 같은 클래스 안에서만 접근할 수 있다.
                       상속 관계에 있는 자식 클래스일지라도 접근할 수 없다.  
                       예를 들어, Getter 와 Setter 를 사용하여 간접 접근만 허용한 경우가 이에 해당한다.
 */
public class 접근제어자 {

}
