package com.kh.regularEx;
/*
      https://regexr.com/
 
 а╓╠т╫д(Regular Expression) : ╧╝юз©╜©║╪╜, ф╞а╓гя ╠тд╒юлЁ╙, фпеою╩ цё╟еЁ╙, ╟к╩Жгр ╤╖
                            ю╞©Кго╟т ╩Г©Кго╠Б ю╖гя г╔гЖ ╧Ф╧Щюл╢ы.
 	1. ╧╝юз©м ╪Щюз
 		 [abc] : a, b, c аъ гоЁ╙©м юод║го╦И ╣х╢ы.
 		[^abc] : a, b, c юл©эюг ╧╝юз©м юод║го╦И ╣х╢ы.
 		 [a-z] : ╪р╧╝юз a╨нем z╠НаЖ ╦П╣Г ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
 		 [A-Z] : ╢К╧╝юз A╨нем Z╠НаЖ ╦П╣Г ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
 		 [0-9] : ╪Щюз 0 ~ 9╠НаЖ ╦П╣Г ╪Щюз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
 		[╟║-фR] : гя╠ш ╟║ ~ фR ╠НаЖ ╦П╣Г гя╠ш ╧╝юз╟║ юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
 		[╓║-╓╬] : юзю╫ ╓║ ~ ╓╬ ╠НаЖ ╦П╣Г гя╠ш юзю╫юл юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
 		[╓©-╓с] : ╦Пю╫ ╓© ~ ╓с ╠НаЖ ╦П╣Г гя╠ш ╦Пю╫юл юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы. 
    
    2. аЖа╓юз
    	* : 0╟Ё юл╩С ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
    	+ : 1╟Ё юл╩С ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
    	? : 0 ╤г╢б 1╟Ёюг ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
      {n} : а╓х╝го╟т n╟Ёюг ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
     {n,} : цж╪р n╟Ё юл╩Сюг ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы.
   {n, m} : цж╪р n╟Ё юл╩С, цж╢К m╟Ёюг ╧╝юз©м юод║го╢баЖ х╝юнгр ╤╖ ╩Г©Кгя╢ы. 
    
    3. ф╞╪Ж╧╝юз
   		. : ╬Н╤╡ гя ╧╝юз©м юод║го╢баЖ
   		^ : ╧╝юз©╜юг ╫цюш ╨н╨п╟З юод║го╢баЖ
   		$ : ╧╝юз©╜юг Ё║ ╨н╨п╟З юод║го╢баЖ
   		\ : ф╞╪Ж╧╝юз╦╕ ╩Г©Кгр ╟мюсю╩ ╬к╥ааы ╤╖ юш╪╨гя╢ы.
   			ф╞╪Ж╧╝юз╦╕ ╩Г©Кго╠Ф ©Ьгя╢ы╦И, \ юш╪╨ хд ╣з©║ юШ╬Наж╬Н╬ъ гя╢ы.
   			
    а╓╠т╫дю╩ ╩Г©Кго╢б ╧Ф╧Щю╨ ©╘╥╞╟║аЖ╟║ юж╢ы.
    Pattern.matches() ╦╕ ╩Г©Кго©╘, юЭц╪ ╧╝юз©╜юл а╓╠т╫д╟З юод║го╢баЖ ©╘╨н╦╕ х╝юнгр ╪Ж╣╣ юж╟М,
    
    ╧╝юз©╜ ╬х©║╪╜ ф╞а╓ ╨н╨п╦╦ а╓╠т╫д╟З юод║го╢баЖ х╝юнго╥а╦И,
    Matcher.find() Matcher.matches()
    String.split()
    ╣Ню╩ ╩Г©Кго╦И ╣х╢ы.
 */
public class а╓╠т╫д {

}
