package com.kh.OopEx;
/*
 객체
  캡슐화 : Getter 와 Setter 를 사용하여 실제 상세정보는 숨기고 외부에서 접근하면서 원본은 유지하고,
  		 원본을 복사하여 외부에서만 수정하고, 수정한 내용을 반환할 수 있도록 하는 것이다.
   상속 : extends 를 사용하여 부모 클래스를 물려 받아, 자식 클래스에 맞게끔 수정한 클래스
  다형성 : @Override. 상속과 연관이 깊다. 부모 클래스에서 물려 받은 자식 클래스가 다시 정의를 내려 메서드나 필드를 사용하는 것이다.
  추상화 : abstract 를 사용하여, 완성하지 않은 희미한 메서드를, 완성할 수 있게 클래스에서 다시 작성해 주는 것을 의미한다.
  인터페이스 : implements 를 사용한다. 객체가 아니기 때문에 객체에서 사용할 수 있고, 인터페이스의 경우 상속을 여러개 받을 때 사용한다.
 
 클래스 : 데이터와, 해당 데이터를 처리하기 위한 행동(메서드) 들의 집합이다.
 		자바에서, 클래스는 객체를 만들기 위한 공간(틀) 이다.
 		클래스 이름은 파일 이름과 일치해야 한다.
 		클래스 이름에는 규칙이 있다.
 			1. 첫 글자를 대문자로 작성했다면, 외부에서 파일 사용이 가능하다는 표시이다.
 			2. 첫 글자를 소문자로 작성했다면, 외부에서 파일 사용을 할 수 없다는 표시이다.
 */
public class 객체 {

}
