package com.kh.OopEx;
/*
 인터페이스 : 미완성된 클래스(클래스가 아니다.)
 		   
 		   인터페이스는 외부에서 완성을 해줘야 하는 클래스이기 때문에, public 을 사용해줘야 한다.
 		   
 		  인터페이스에 작성되는 필드들은 모두 상수로 작성되기 때문에, 대문자로 이름을 작성해주어야 한다.
 		  
  		  메서드를 작성할 때, 메서드 이름과 메서드 매개변수 및 반환을 어떻게 처리할지만 지정해주고,
  		  메서드의 본 내용은 작성하지 않는다.
  		  인터페이스는 implements 를 작성한 후, 인터페이스 파일명을 작성하여 호출한다.
  		  파일명은 , 를 사용하여 여러개를 작성해도 된다.
  		  extends 를 사용한 다음 implements 를 사용할 수도 있다.
  		  
  		  public class 자식 extends 부모 implements 친구, 친척 {		}
  		  public class 자식 extends 부모 implements 친구 {		    }
  		  
  		  접근제한자     반환유무     메서드명();
  		          void 또는 자료형
  		  
  		  인터페이스에서 사용하면 안되는 메서드 예제
  		  핵심은 메서드명 이후 { } 를 추가하면 안 된다는 것이다.
  		  
  		  접근제한자 void 메서드이름() {
  		  
  		  }        
  		  접근제한자 자료형 메서드이름() {
  		  		return
  		  }
 */
public interface 인터페이스 {

}
