package com.kh.ForEx;
/*
 for 문 : 가장 대표적인 반복문으로, 특정 조건이 참일 때만 반복하고, 참에서 벗어나면 반복을 종료한다. 
 		 for 문 안에는 초기화식, 조건식, 증감식을 넣어, 반복 횟수를 조정한다.
 		 반복 횟수의 끝이 정해져 있거나, 반복하는 기준이 있을 때 사용한다.
 	for(초기화식; 조건식; 증감식) {
 		// 조건이 참일 때 실행할 코드 작성
 	}
 	
 for - each 문 : 컬렉션이나 배열을 반복해서, 처음부터 끝까지 순회할 때 사용한다.
 				반복문을 간결하게 작성할 수 있고, 배열 안에 있는 데이터 갯수에 따라 자동으로 반복한다.
 	for(자료형 변수명 : 컬렉션 또는 배열) { // 컬렉션 : List Set Map 등
 		// 각 데이터마다 실행되는 코드 작성
 		// 데이터가 없으면 자동으로 for 문을 탈출한다.
 	}
 	
 다중 for 문 : for 문 안에 for 문이 존재하는 것으로, 무제한 생성 가능하지만, 메모리 소모가 크기 때문에 권장되지는 않는다.
	 for(초기화식; 조건식; 증감식) {
	 	실행할 코드는 각 자리에서 있어도 되고, 없어도 된다.
	 	for(초기화식; 조건식; 증감식) {
	 		실행할 코드는 각 자리에서 있어도 되고, 없어도 된다.
	 	}
	 	실행할 코드는 각 자리에서 있어도 되고, 없어도 된다.
	 }
 */
public class For문 {

}
