package com.kh.OperatorEx;
/*
 연산자 : 연산하기 위해 사용되는 부등호나 값을 뜻한다.
 	
 	산술 : +   -   *   /(몫)   %(나머지)
 	
 	비교 : ==(같다)   !=(다르다)   >(크다)   >=(크거나 같다)   <(작다)   <=(작거나 같다)
 	  정수, 실수, 문자를 비교할 때는 위의 비교연산자들을 사용하여 판단하면 됐지만,
 	          문자열을 비교할 때는 .equals() 를 사용하여 판단해야 한다. 
 	          = 은 equals == 니까 equals
 	
 	논리 : (좌항) && (우항)				    (좌항) || (우항)
	 	   ┌────┴────┐	                 ┌────┴────┐     
	 	   참    참   참	                 참    참   참
	 	   참   거짓  거짓		             참    참   거짓
	 	  거짓   거짓   참 		             거짓   참   참
	 	    				             거짓  거짓  거짓
 */
public class 연산자 {

}
